# 定义员工信息字典
employees = [
    {'姓名': '王力鸿', '部门': '科技部', '工资': 3000, '级别': 1},
    {'姓名': '周杰轮', '部门': '市场部', '工资': 5000, '级别': 2},
    {'姓名': '林俊节', '部门': '市场部', '工资': 7000, '级别': 3},
    {'姓名': '张学油', '部门': '科技部', '工资': 4000, '级别': 1},
    {'姓名': '刘德滑', '部门': '市场部', '工资': 6000, '级别': 2}
]

# 通过for循环，对所有级别为1级的员工，级别上升1级，薪水增加1000元
for employee in employees:
    if employee['级别'] == 1:
        employee['级别'] += 1
        employee['工资'] += 1000
# 通过

# 输出更新后的员工信息
for employee in employees:
    print(f"姓名: {employee['姓名']}, 部门: {employee['部门']}, 工资: {employee['工资']}, 级别: {employee['级别']}")
